#language: ru
 Функционал: Телевизор

  Сценарий: Выбор телевизора

    Когда выбран пункт меню "Маркет"
    Когда выбрана категория 'Электроника'
    Когда выбрана подкатегория - 'Телевизоры'
    Тогда выбирается пункт 'Все фильтры'
    Тогда выбирается минимальная сумма
    Тогда выбираются производители
    Тогда нажимается кнопка 'Применить'
    Тогда выбирается 12 товаров на странице
    Тогда проверяется, что элементов на странице 12
    Когда вводится название товара в поисковую строку
    Тогда выбирается соответствующий товар из выпадающего списка
    Тогда проверяется, что выбранный товар соответствует запомненному значению

